Documents/ESB/ESB_Consumer_0616/003TestSample/SAMPLE_XML_MUST/BankCard/BC03_BankCardRgstrRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/BankCard/BankCardRgstrRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>BankCard</ServiceDomain>  
      <OperationName>BankCardRgstr</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:BankCardRgstrRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>BC03</v11:TxnId>  
        <v11:TxnNo>BC0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>0048000000000001</v11:CardNo>  
        <v11:CardStatCode>A</v11:CardStatCode>  
        <v11:ChrgFlg>Y</v11:ChrgFlg> 
      </v11:ServiceBody> 
    </v11:BankCardRgstrRq> 
  </soap:Body> 
</soap:Envelope>
